# coding: utf-8
from hip2unicode.functions import hip2unicode as h2u

text = ur'''<::лат>clav.org

<::слав>f~ jь<::лат>LAT ENGLISH etc. <::слав>Хр\ста` чл~вjьколю'бца стр\сте'мъ поревнова'вше 
стр\стоте'рпцы, тjьлеса` о_у='бw на ра^ны преда'сте, и= 
гw'рькимъ му'камъ, тьма'мъ же болjь'знемъ, jа='кw 
предзря'ще при'снw рая` бж~е'ственное наслажде'нiе, пи'щу 
же неиждива'емую и= вjь'чнующее бл~госла'вiе, _е='же 
получи'вше, моли'теся w= воспjьва'ющихъ ва'съ.


Честна` сме'рть ст~ы'хъ твои'хъ гд\си: мече'мъ бо и= 
_о=гне'мъ, и= душе'ю сокруше'нною пролiя'ша крw'ви своя^, 
о_у=пова'нiе и=му'ще на тя`, воспрiя'ти трудw'въ мзду`, 
и= претерпjь'вше прiя'ша w\т тебе` сп~се, ве'лiю мл\сть.


Стi'хъ: Jа='кw о_у=тверди'ся мл\сть _е=гw` на на'съ и= 
и='стина гд\сня пребыва'етъ во вjь'къ.'''


converted_text = h2u(text)
hr = '-' * 30

print hr
print text
print hr
print converted_text
print hr
