# -*- coding: UTF-8 -*-

"""
HIP to Civil Russian

Перекодировка в русскую гражданку.

"""

from hip2unicode.representations.RE import *
from hip2unicode.representations.hip import *
from hip2unicode.representations import antconc

conversion = (
        (ur'<\(\(>', u'«'),      # замена кавычек <((>
        (ur'<\)\)>', u'»'),      # <))>
        (ur'<->',    u'\u2014'), # тире EM DASH

        # удаление ненужных html-тегов 
        (ur'<p>',    u''),
        (ur'<a.*?>', u''),
        (ur'</a>',   u''),
        (ur'<br>',   u''),
        (ur'<hip>',  u''),
        (ur'</hip>',     u''),
        (ur'<title>',    u''),
        (ur'</title>',   u''),
        (ur'<pre>',      u''),
        # hip-нормализация
        # ...
        # удаление ненужной разметки
        # киноварь
        (ur'%<',    u''),
        (ur'%>',    u''),

        (ur'%\(',   u''),
        (ur'%\)',   u''),

        (ur'%\[',   u''),
        (ur'%\]',   u''),

        (ur'\([cсCС]\.\ *\d+\)',    u''),

        (ur'%{![^{}]+?{[^{}]*?}[^{}]*?}',   u''),
        (ur'%{![^{}]+?}',                   u''),
        (ur'%{Глава`}',                     u'Глава '),
        (ur'%t',                            u''),

        # сноски
        # <сноска 1> ::= *{  <текст сноски> *  <текст сноски> }
        (ur'\*{.*?\*.*?}',          u''),
        # <сноска 2> ::= **{ <текст сноски> ** <текст сноски> }
        (ur'\*\*{.*?\*\*.*?}',      u''),

        # Знаки типикона для обозначения разных типов служб (шестеричная,
        # полиелейная и т.п.)
        (ur'<\(\+\)>',  u''), #     <(+)>   Бдение под великие праздники
        (ur'<\\\+/>',   u''), #     <\+/>   Бдение
        (ur'<\+>',      u''), #      <+>    Полиелей
        (ur'<\(:\.>',   u''), #     <(:.>   Славословие или шестеричная служба
        (ur'<М\\р>',    u''), #     <М\р>

        # символ "бреве" над буквой, иногда кавыка (?)
        (ur'\\\@',      u''), #     \@
        (ur'\\\[\@\]',  u''), #     \[@]

        # настоящие сноски
        # Имеют вид:
        #
        #    <text> ::= <текст, к которому относится сноска>
        #    <note> ::= <текст сноски>
        #
        #    1) <text>@{<note>}
        #    2) @<text>@{@<note>@}
        #    3) @@<text>@@{@@<note>@@}
        #

        (ur'\{\s+\@',   u'{@'),
        (ur'\@\s+\}',   u'@}'),

        # звездочки для поющих на клиросе
        (ur'\*',    u''),
        # разделения на строки -- //
        # и разделители для поющих на клиросе -- /
        (ur'/',    u''),
        # широкая омега
        (ur'<_w>',  u'о'),
        (ur'<_W>',  u'О'),
        # (сверх)узкое о
        (ur'<о_>',  u'о'), # кирил.
        (ur'<o_>',  u'о'), # лат.
        # разные зело и земли
        (ur'<з>',    u'з'),
        (ur'<_з>',   u'з'),

        # Regular expressions for character replacement
        # in text marked as being typed in Church Slavonic script
        # (script tag <::слав> or without any script tag
        # if no script tag is in the document)
        (A, u'А'),
        (a, u'а'),

        (B, u'Б'),
        (b, u'б'),

        (E, u'Е'),
        (e, u'е'),

        (ur's', u'з'),
        (ur'S', u'З'),
        (i_without_dot, ur'\u0131'), # U+0131 LATIN SMALL LETTER DOTLESS I

        (K, u'К'),
        (k, u'к'),

        (M, ur'\1'),
        (m, ur'\1'),

        (H, u'Н'),
        (h, u'н'),

        (O, u'О'),
        (o, u'о'),

        (P, u'Р'),
        (p, u'р'),

        (C, u'С'),
        (c, u'с'),

        (T, u'Т'),
        (t, u'т'),

        (X, u'Х'),
        (x, u'х'),

        (V_double_gravis, antconc.CAPITAL_IZHICA),
        (v_double_gravis, antconc.SMALL_IZHICA),

        (Ole, u'О'),
        (ole, u'о'),

        (Wide_E, u'Е'),
        (wide_e, u'е'),

        (Yat, u'Е'),
        (yat, u'е'),

        (V, antconc.CAPITAL_IZHICA),
        (v, antconc.SMALL_IZHICA),

        (Ksi, u'Кс'),
        (ksi, u'кс'),

        (Wide_O, u'О'),
        (wide_o, u'о'),

        (Ot, u'От'),
        (ot, u'от'),

        (Psi, u'Пс'),
        (psi, u'пс'),

        (F, u'Ф'),
        (f, u'ф'),

        (J_a, u'Я'),
        (j_a, u'я'),

        (Ja, u'Я'),
        (ja, u'я'),

        (equal_sign, ur''), # ur'’', # U+2019 RIGHT SINGLE QUOTATION MARK : single comma quotation mark
#    (single_quote, antconc.acute),
#    (back_single_quote, antconc.gravis),
#    (caret, antconc.circumflex),
#    (tilde, antconc.titlo),

        (ur'\\[бБ]', ur'\Б'),
        (ur'\\[вВ]', ur'\В'),
        (ur'\\[гГ]', ur'\Г'),
        (ur'\\[дД]', ur'\Д'),
        (ur'\\[жЖ]', ur'\Ж'),
        (ur'\\[зЗ]', ur'\З'),
        (ur'\\[кК]', ur'\К'),
        (ur'\\[лЛ]', ur'\Л'),
        (ur'\\[мМ]', ur'\М'),
        (ur'\\[нН]', ur'\Н'),
        (ur'\\[оО]', ur'\О'),
        (ur'\\[пП]', ur'\П'),
        (ur'\\[рР]', ur'\Р'),
        (ur'\\[сС]', ur'\С'),
        (ur'\\[тТ]', ur'\Т'),
        (ur'\\[%s%s]' % (antconc.SMALL_FITA, antconc.CAPITAL_FITA), ur'\Ф'),
        # ^ нельзя писать ur'\\[fF]', т.к. они уже ранее были заменены на антконковские фиты.
        (ur'\\[хХ]', ur'\Х'),
        (ur'\\[цЦ]', ur'\Ц'),
        (ur'\\[чЧ]', ur'\Ч'),
        (ur'\\[шШ]', ur'\Ш'),
        (ur'\\[ъЪ]', ur'\Ъ'),

        (Oy, u'У'),
        (oy, u'у'),

        (W, u'О'),
        (w, u'о'),

        (ur'(?<!_)' + Y, u'У'),
        (ur'(?<!_)' + y, u'у'),

        (ur'i', u'и'),
        (ur'I', u'И'),

        (ur'_у', u'у'),
        (ur'#', u'\u0482'), # знак тысячи

        (ur'\ {2,}',    u' '), # два и более пробелов заменяем на один
    
    
    
    
    
    (ur"['`\^]",          u''),

    (ur'([Аа])[Пп]\\С[Лл]', ur'\1постол'),
    (ur'([Бб])[Гг]~',       ur'\1ог'),
    (ur'([Бб])ж~тв',        ur'\1ожеств'),
    (ur'([Бб])ж~',          ur'\1ож'),
    (ur'([Бб])ж\\Ств',      ur'\1ожеств'),
    (ur'([Бб])з~',          ur'\1оз'),
    (ur'([Бб])л~г',   ur'\1лаг'),
    (ur'([Бб])л~ж',   ur'\1лаж'),
    (ur'([Бб])л~з',   ur'\1лаз'),
    (ur'([Бб])л\\Гв',   ur'\1лагов'),
    (ur'([Бб])лг\\Дт',  ur'\1лагодат'),
    (ur'([Бб])лг\\Св',  ur'\1лагослов'),
    (ur'([Бб])лг\\Сл',  ur'\1лагосл'),
    (ur'([Бб])лг\\С',   ur'\1лагос'),
    (ur'([Бб])ц\\Д',    ur'\1огородиц'),
    (ur'([Вв])л\\Дк',   ur'\1ладык'),
    (ur'([Вв])л\\Дц',   ur'\1ладыц'),
    (ur'([Вв])л\\Дчц',  ur'\1ладычиц'),
    (ur'([Вв])л\\Дч',   ur'\1ладыч'),
    (ur'ѵ\\Гл',         ur'вангел'), # Евангел...
    (ur'ѵ\\Г',          ur'ванг'),   # Евангел...
    (ur'гг~л',          ur'нгел'),   # ангел
    (ur'([Гг])л~',      ur'\1лагол'),
    (ur'([Гг])л\\В',    ur'\1лав'),
    (ur'([Гг])д\\Снь',  ur'\1осподень'),
    (ur'([Гг])д\\Св',   ur'\1осподев'),
    (ur'([Гг])д\\С',    ur'\1оспод'),
    (ur'([Гг])п\\Сж',   ur'\1оспож'),
    (ur'([Дд])в~д',     ur'\1авид'),
    (ur'([Дд])в~',      ur'\1ев'),
    (ur'([Дд])в\\Ств',  ur'\1евств'),
    (ur'([Дд])с~',      ur'\1ус'),
    (ur'([Дд])х~',      ur'\1ух'),
    (ur'([Дд])ш~',      ur'\1уш'),
    (ur'([Ии])~с',      ur'\1сус'),
    (ur'([Ии])и~л',     ur'\1зраил'),
    (ur'([Кк])р~с',     ur'\1рес'),
    (ur'([Кк])р\\Ст',   ur'\1рест'),
    (ur'([Мм])\\Др',    ur'\1удр'),
    (ur'([Мм])л~тв',    ur'\1олитв'),
    (ur'([Мм])л\\Днцъ', ur'\1ладенец'),
    (ur'([Мм])л\\Дн',   ur'\1ладен'),
    (ur'([Мм])л\\Срд',  ur'\1илосерд'),
    (ur'([Мм])л\\Ст',   ur'\1илост'),
    (ur'([Мм])л\\С',    ur'\1илос'),
    (ur'([Мм])т~р',     ur'\1атер'),
    (ur'([Мм])т~',      ur'\1ат'),
    (ur'([Мм])р~і',     ur'\1ари'),
    (ur'([Мм])\\Рк',    ur'\1ярек'),   # Имярек
    (ur'([Мм])ч~нк',    ur'\1ученик'),
    (ur'([Мм])ч~нц',    ur'\1учениц'),
    (ur'([Мм])ч~нч',    ur'\1ученич'),
    (ur'([Мм])ч~н',     ur'\1учен'),
    (ur'([Мм])ц\\С',    ur'\1есяц'),
    (ur'([Нн])б~с',     ur'\1ебес'),
    (ur'([Нн])б\\C',    ur'\1ебес'),
    (ur'([Нн])б~',      ur'\1еб'),
    (ur'([Нн])л\\Д',    ur'\1едел'),
    (ur'([Нн])н~',      ur'\1ын'),
    (ur"([Оо])ч~ь",     ur'\1течь'),
    (ur"([Оо])ч~ес",    ur'\1течес'),
    (ur"([Оо])ч~",      ur'\1тч'),
    (ur"([Оо])ц~ъ",     ur'\1тец'),
    (ur"([Оо])ц~",      ur'\1тц'),
    (ur'([Пп])рв\\Днъ', ur'\1раведен'),
    (ur'([Пп])рв\\Дн',  ur'\1раведн'),
    (ur'([Пп])р\\Дтч',  ur'\1редтеч'), # Предтеча
    (ur'([Пп])р\\Дт',   ur'\1редт'),   # Предтеча
    (ur'([Пп])рп\\Дб',  ur'\1реподоб'),
    (ur'([Пп])р\\Ор',   ur'\1рор'),    # Пророк
    (ur'([Пп])р\\Сн',   ur'\1рисн'),
    (ur'([Пп])р\\Ст',   ur'\1рест'),
    (ur'([Пп])рч\\Ст',  ur'\1речист'),
    (ur'([Пп])\\Скп',   ur'\1ископ'),  # епископ
    (ur'([Пп])\\Ск',    ur'\1иск'),
    (ur'([Рр])ж\\Ств',  ur'\1ождеств'),
    (ur'([Рр])\\Сл',    ur'\1усал'),   # Иерусалим
    (ur'([Сс])л~нц',    ur'\1олнц'),
    (ur'([Сс])н~',      ur'\1ын'),
    (ur'([Сс])п~с',     ur'\1пас'),
    (ur'([Сс])п\\Сн',   ur'\1пасен'),
    (ur'([Сс])р\\Дц',   ur'\1ердц'),
    (ur'([Сс])р\\Дч',   ur'\1ердеч'),
    (ur'([Сс])т~',      ur'\1вят'),
    (ur'([Сс])тр\\Ст',  ur'\1траст'),
    (ur'([Сс])\\Х',     ur'\1тих'),
    (ur'([Сс])т\\Хр',   ur'\1тихир'),
    (ur'([Сс])щ~',      ur'\1вящ'),
    (ur'([Тт])р\\Оц',   ur'\1роиц'),
    (ur'([Тт])р\\Оч',   ur'\1роич'),
    (ur'([Тт])р\\Ст',   ur'\1рисвят'),
    (ur'([Хх])р\\Ст',   ur'\1рист'),
    (ur'([Цц])р~к',     ur'\1ерк'),
    (ur'([Цц])р~',      ur'\1ар'),
    (ur'([Цц])р\\С',    ur'\1арс'),
    (ur'([Чч])л~в',     ur'\1елов'),
    (ur'([Чч])~нк',     ur'\1еник'),
    (ur'([Чч])~нц',     ur'\1ениц'),
    (ur'([Чч])~тл',     ur'\1ител'),
    (ur'([Чч])н~к',     ur'\1еник'),
    (ur'([Чч])н~ц',     ur'\1ениц'),
    (ur'([Чч])н~',      ur'\1ен'),
    (ur'([Чч])\\Стн',   ur'\1естн'),
    (ur'([Чч])т\\Сн',   ur'\1естн'),
    (ur'([Чч])\\Ст',    ur'\1ист'),
    (ur'([Чч])т\\С',    ur'\1ист'),
    (ur'([Чч])т~л',     ur'\1ител'),

    (ur'а' + antconc.SMALL_IZHICA,   u'ав'),
    (ur'е' + antconc.SMALL_IZHICA,   u'ев'),
    (antconc.SMALL_IZHICA,      u'и'),

    (ur'\\Ъ',        u'ъ'),
    (ur'ъ$',         u''),
    (ur'ъа',         u'а'),
    (ur'ъо',         u'о'),
    (ur'ъу',         u'у'),
    (ur'ъы',         u'ы'),
    (ur'ъи',         u'ы'),
)
